<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2//EN">
<HTML>
<HEAD>
	<META HTTP-EQUIV="CONTENT-TYPE" CONTENT="text/html; charset=windows-1252">
	<TITLE></TITLE>
	<META NAME="GENERATOR" CONTENT="StarOffice 6.0  (Win32)">
	<META NAME="CREATED" CONTENT="20021230;19414546">
	<META NAME="CHANGED" CONTENT="20021230;19585804">
</HEAD>
<BODY LANG="en-US">
<P><FONT FACE="Arial, sans-serif"><FONT SIZE=5 STYLE="font-size: 20pt"><U>Delphi
Tools Version 2</U><BR><FONT SIZE=2>Jahr 2002</FONT></FONT></FONT></P>
<P><B>BETA DOKUMENTATION<BR>(diese Hilfe ist nicht komplett)</B></P>
<P><FONT SIZE=4>Herzlich Willkommen zur Delphi Tools Hilfe...</FONT></P>
<P><FONT SIZE=4>Diese Hilfe enth&auml;lt zu jeder Funktion, Prozedur,
Variablen, Konstante, Typ und Klasse einen Hilfetext.<BR>Derzeit
wurde das gesamte Projekt aufeinmal in diese Hilfe &uuml;berf&uuml;hrt,
und kann noch Fehler aufweisen!<BR>In diesem Fall mailen Sie bitte an
<A HREF="mailto:removed">removed</A>.<BR><BR>DelphiTools
wurde urspr&uuml;nglich nur f&uuml;r den privaten Gebrauch
entwickelt, um die immer wiederkehrenden Aufgaben<BR>im Arbeitsleben
in Delphi schneller l&ouml;sen zu k&ouml;nnen. Es kann nicht f&uuml;r
jeden und alles eine Musterl&ouml;sung geben.<BR>Die in den Units
enthaltenen L&ouml;sungen sind soweit allgemein gehalten, damit sie
auch in anderen &auml;hnlichen Gebieten<BR>verwendet werden k&ouml;nnen.
Glauben Sie bitte nicht, dass Sie hier f&uuml;r Ihr Problem eine
L&ouml;sung finden, die es komplett<BR>aus der Welt schafft.
DelphiTools wurde nicht umsonst unter der GPL (GNU Public License)
mit Quelltext gestellt.<BR>Sie k&ouml;nnen beliebig den Quelltext
aufnehmen und ihren Anforderungen anpassen, solange dies unter den
Bedingungen<BR>der GPL geschieht (siehe gleichnamigen Topic).
<BR><BR>DelphiTools wurde f&uuml;r Delphi 7 entwickelt. Es wird nicht
gew&auml;hrleistet, dass sie in &auml;lteren oder/und<BR>neueren
Delphiversion compiliert werden kann.<BR></FONT><BR><BR>
</P>
<P><FONT SIZE=4>DelphiTools wird immer weiterentwickelt! Es kommen
dauernd neue Funktionen dazu, und wir sind bem&uuml;ht <BR>den Umfang
zu erweitern, ohne den &Uuml;berblick zu tr&uuml;ben.<BR>Wenn Sie
Lust haben, k&ouml;nnen Sie Ihre Ideen, Vorschl&auml;ge, einflie&szlig;ende
Quellcodes an <A HREF="mailto:removed">removed</A>
schicken,<BR>und somit einen Teil zu DelphiTools beitragen. Ihre
Bem&uuml;hungen werden durch Anzeige des Namens neben des Hilfetext
honoriert.</FONT></P>
<P><FONT SIZE=4>Ich w&uuml;nsche noch viel Spass<BR>Euere DelphiTools
Community<BR>und</FONT></P>
<P><FONT SIZE=4>author</FONT></P>
<P><FONT SIZE=4>29 Dezember 2002</FONT></P>
</BODY>
</HTML>